Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateThis Property
 Can't create [Element].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateThis { get; }
Public Shared ReadOnly Property CannotCreateThis As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateThis {
	FailureDefinitionId^ get ();
}
static member CannotCreateThis : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace